Documents/Планирование_ВыполнениеПлановПоУЗП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Планирование_ВыполнениеПлановПоУЗП</Name>
			<BasedOn>
				<xr:Item>Document.Планирование_УстановкаПлановПоУЗП</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоОплатеТруда</xr:Item>
				<xr:Item>AccumulationRegister.ФинансовыйРезультат</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыССотрудниками</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Планирование_УстановкаПлановПоУЗП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательКПИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиКПИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШкалаОценкиПоказателяКПИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШкалыОценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СегментПартнеров</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СегментыПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеВыполненНорматив</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АнализВыполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СегментПартнеров</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СегментыПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОценки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасчетЗарплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БазыРасчетаЗарплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СегментПартнеров</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СегментыПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаРасчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СоответствиеПоказательКПИВидРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеПоказательКПИВидРасчета</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательКПИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиКПИ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Планирование_ВыполнениеПлановПоУЗП/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область КомандыФормы

&НаКлиенте
Процедура КомандаРасчетЗарплаты(команда)
	КомандаРасчетЗарплатыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

&НаСервере
Процедура КомандаРасчетЗарплатыНаСервере()

	запрос = Новый Запрос;
	запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	#Область ТекстЗапроса
	
	запрос.Текст =
	"ВЫБРАТЬ
	|	Планирование_ВыполнениеПлановПоУЗП.Ссылка,
	|	Планирование_ВыполнениеПлановПоУЗП.Дата,
	|	Планирование_ВыполнениеПлановПоУЗП.Подразделение,
	|	Планирование_ВыполнениеПлановПоУЗП.ДокументОснование,
	|	Планирование_ВыполнениеПлановПоУЗП.ПоказательКПИ,
	|	Планирование_ВыполнениеПлановПоУЗП.ШкалаОценкиПоказателяКПИ
	|ПОМЕСТИТЬ ВТ_ШапкаДокумента
	|ИЗ
	|	Документ.Планирование_ВыполнениеПлановПоУЗП КАК Планирование_ВыполнениеПлановПоУЗП
	|ГДЕ
	|	Планирование_ВыполнениеПлановПоУЗП.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Планирование_УстановкаПлановПоУЗПСостав.Подразделение,
	|	Планирование_УстановкаПлановПоУЗПСостав.СегментПартнеров,
	|	Планирование_УстановкаПлановПоУЗПСостав.План,
	|	0 КАК Факт,
	|	0 КАК НеВыполненНорматив
	|ПОМЕСТИТЬ ВТ_ИсходныеДанные
	|ИЗ
	|	Документ.Планирование_УстановкаПлановПоУЗП.Состав КАК Планирование_УстановкаПлановПоУЗПСостав
	|ГДЕ
	|	Планирование_УстановкаПлановПоУЗПСостав.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ШапкаДокумента.ДокументОснование
	|			ИЗ
	|				ВТ_ШапкаДокумента КАК ВТ_ШапкаДокумента)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Планирование_ВыполнениеПлановПоУЗПИсходныеДанные.Подразделение,
	|	Планирование_ВыполнениеПлановПоУЗПИсходныеДанные.СегментПартнеров,
	|	0,
	|	Планирование_ВыполнениеПлановПоУЗПИсходныеДанные.Факт,
	|	Планирование_ВыполнениеПлановПоУЗПИсходныеДанные.НеВыполненНорматив
	|ИЗ
	|	Документ.Планирование_ВыполнениеПлановПоУЗП.ИсходныеДанные КАК Планирование_ВыполнениеПлановПоУЗПИсходныеДанные
	|ГДЕ
	|	Планирование_ВыполнениеПлановПоУЗПИсходныеДанные.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ШапкаДокумента.Ссылка
	|			ИЗ
	|				ВТ_ШапкаДокумента КАК ВТ_ШапкаДокумента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШкалыОценкиПорогиЗначений.Порог КАК ПорогНачало,
	|	МИНИМУМ(ШкалыОценкиПорогиЗначений1.Порог) КАК ПорогОкончание,
	|	СРЕДНЕЕ(ШкалыОценкиПорогиЗначений.Значение) КАК Значение
	|ПОМЕСТИТЬ ВТ_ШкалаОценки
	|ИЗ
	|	Справочник.ШкалыОценки.ПорогиЗначений КАК ШкалыОценкиПорогиЗначений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШкалыОценки.ПорогиЗначений КАК ШкалыОценкиПорогиЗначений1
	|		ПО ШкалыОценкиПорогиЗначений.Порог < ШкалыОценкиПорогиЗначений1.Порог
	|ГДЕ
	|	ШкалыОценкиПорогиЗначений.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ШапкаДокумента.ШкалаОценкиПоказателяКПИ
	|			ИЗ
	|				ВТ_ШапкаДокумента КАК ВТ_ШапкаДокумента)
	|	И ШкалыОценкиПорогиЗначений1.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ШапкаДокумента.ШкалаОценкиПоказателяКПИ
	|			ИЗ
	|				ВТ_ШапкаДокумента КАК ВТ_ШапкаДокумента)
	|
	|СГРУППИРОВАТЬ ПО
	|	ШкалыОценкиПорогиЗначений.Порог
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПорогНачало,
	|	ПорогОкончание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СгруппированныеДанные.Подразделение,
	|	СгруппированныеДанные.СегментПартнеров,
	|	СгруппированныеДанные.Факт КАК Показатель,
	|	СгруппированныеДанные.Факт / СгруппированныеДанные.План * 100 КАК Выполнение,
	|	ВЫБОР
	|		КОГДА СгруппированныеДанные.НеВыполненНорматив = 1
	|				И ЕСТЬNULL(ВТ_ШкалаОценки.Значение, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ВТ_ШкалаОценки.Значение, 0)
	|	КОНЕЦ КАК ЗначениеОценки
	|ПОМЕСТИТЬ ВТ_АнализВыполнения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ИсходныеДанные.Подразделение КАК Подразделение,
	|		ВТ_ИсходныеДанные.СегментПартнеров КАК СегментПартнеров,
	|		МАКСИМУМ(ВТ_ИсходныеДанные.План) КАК План,
	|		МАКСИМУМ(ВТ_ИсходныеДанные.Факт) КАК Факт,
	|		МАКСИМУМ(ВТ_ИсходныеДанные.НеВыполненНорматив) КАК НеВыполненНорматив
	|	ИЗ
	|		ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ИсходныеДанные.Подразделение,
	|		ВТ_ИсходныеДанные.СегментПартнеров) КАК СгруппированныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ШкалаОценки КАК ВТ_ШкалаОценки
	|		ПО (ВТ_ШкалаОценки.ПорогНачало < СгруппированныеДанные.Факт / СгруппированныеДанные.План * 100)
	|			И (ВТ_ШкалаОценки.ПорогОкончание >= СгруппированныеДанные.Факт / СгруппированныеДанные.План * 100)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ШапкаДокумента.Ссылка КАК Ссылка,
	|	ВТ_АнализВыполнения.Подразделение,
	|	ВТ_АнализВыполнения.СегментПартнеров,
	|	ВТ_АнализВыполнения.Показатель,
	|	ВТ_АнализВыполнения.Выполнение,
	|	ВТ_АнализВыполнения.ЗначениеОценки,
	|	1 КАК ВесПоказателя,
	|	ВложенныйЗапрос.ОбщийВесПоказателя,
	|	ВТ_ШапкаДокумента.ПоказательКПИ КАК ДокументПоказательКПИ,
	|	ВТ_ШапкаДокумента.Подразделение КАК ДокументПодразделение
	|ПОМЕСТИТЬ ВТ_ПромежуточныйРасчет
	|ИЗ
	|	ВТ_АнализВыполнения КАК ВТ_АнализВыполнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_АнализВыполнения.СегментПартнеров КАК СегментПартнеров,
	|			СУММА(1) КАК ОбщийВесПоказателя
	|		ИЗ
	|			ВТ_АнализВыполнения КАК ВТ_АнализВыполнения
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_АнализВыполнения.СегментПартнеров) КАК ВложенныйЗапрос
	|		ПО ВТ_АнализВыполнения.СегментПартнеров = ВложенныйЗапрос.СегментПартнеров,
	|	ВТ_ШапкаДокумента КАК ВТ_ШапкаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Планирование_ВыполнениеПлановПоУЗПБазыРасчетаЗарплаты.Ссылка,
	|	Планирование_ВыполнениеПлановПоУЗПБазыРасчетаЗарплаты.НомерСтроки,
	|	Планирование_ВыполнениеПлановПоУЗПБазыРасчетаЗарплаты.СегментПартнеров,
	|	Планирование_ВыполнениеПлановПоУЗПБазыРасчетаЗарплаты.Сотрудник,
	|	Планирование_ВыполнениеПлановПоУЗПБазыРасчетаЗарплаты.БазаРасчета
	|ПОМЕСТИТЬ ВТ_БазыРасчета
	|ИЗ
	|	Документ.Планирование_ВыполнениеПлановПоУЗП.БазыРасчетаЗарплаты КАК Планирование_ВыполнениеПлановПоУЗПБазыРасчетаЗарплаты
	|ГДЕ
	|	Планирование_ВыполнениеПлановПоУЗПБазыРасчетаЗарплаты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АнализВыполнения.Подразделение,
	|	ВТ_АнализВыполнения.СегментПартнеров,
	|	ВТ_АнализВыполнения.Показатель,
	|	ВТ_АнализВыполнения.Выполнение,
	|	ВТ_АнализВыполнения.ЗначениеОценки
	|ИЗ
	|	ВТ_АнализВыполнения КАК ВТ_АнализВыполнения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПромежуточныйРасчет.СегментПартнеров,
	|	ВТ_БазыРасчета.Сотрудник,
	|	СоответствиеПоказательКПИВидРасчетаСрезПоследних.ВидРасчета,
	|	ВТ_БазыРасчета.БазаРасчета * (ВТ_ПромежуточныйРасчет.ВесПоказателя / ВТ_ПромежуточныйРасчет.ОбщийВесПоказателя) * ВТ_ПромежуточныйРасчет.ЗначениеОценки КАК Результат
	|ИЗ
	|	ВТ_ПромежуточныйРасчет КАК ВТ_ПромежуточныйРасчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БазыРасчета КАК ВТ_БазыРасчета
	|		ПО ВТ_ПромежуточныйРасчет.СегментПартнеров = ВТ_БазыРасчета.СегментПартнеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеПоказательКПИВидРасчета.СрезПоследних(&ДатаСреза, ) КАК СоответствиеПоказательКПИВидРасчетаСрезПоследних
	|		ПО ВТ_ПромежуточныйРасчет.ДокументПодразделение = СоответствиеПоказательКПИВидРасчетаСрезПоследних.Подразделение
	|			И ВТ_ПромежуточныйРасчет.ДокументПоказательКПИ = СоответствиеПоказательКПИВидРасчетаСрезПоследних.ПоказательКПИ";
	
	#КонецОбласти
	
	запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	запрос.УстановитьПараметр("ДатаСреза", Объект.Дата);
	
	результатЗапроса = запрос.ВыполнитьПакет();
	
	#Область ПолучениеВременныхТаблиц
	
	запрос.Текст =
	"ВЫБРАТЬ * ИЗ ВТ_АнализВыполнения;
	|ВЫБРАТЬ * ИЗ ВТ_БазыРасчета;";
	
	#КонецОбласти
	
	Объект.АнализВыполнения.Загрузить(результатЗапроса[6].Выгрузить());
	Объект.РасчетЗарплаты.Загрузить(результатЗапроса[7].Выгрузить());
	
КонецПроцедуры

#КонецОбласти
